app/Models/LoginAccessModel.php

SELECT *
FROM `usuarios`
WHERE `usuario` = 'AlejandroAdmin'
---
        public function obtenerUsuario($usuario) {

            $Usuario = $this->db->table('usuarios');
            $Usuario->where($usuario);

            return $Usuario->get()->getResultArray();