app/Models/PacientesCRUDModel.php

SELECT *
FROM `tratamiento`
WHERE `id_paciente` = '1'
---
        public function getTratamientoInfoById($id_paciente) {
            $TratamientoInfoById = $this->db->table('tratamiento');
            $TratamientoInfoById->where($id_paciente);

            return $TratamientoInfoById->get()->getResultArray();